[
  {
    "question_id": "",
    "title": "Trapping Rain Water",
    "description": "Given an array of non-negative integers representing the height of walls, compute how much water can be trapped after raining. You can assume the width of each wall is 1.",
    "topic": "Array",
    "subtopic": "Two Pointers",
    "tags": [
      "Array",
      "Two Pointers",
      "Dynamic Programming"
    ],
    "input_format": "An array of integers heights where heights[i] is the height of the ith wall.",
    "output_format": "An integer representing the total amount of water that can be trapped.",
    "constraints": [
      "0 <= heights.length <= 2 * 10^4",
      "0 <= heights[i] <= 10^5"
    ],
    "examples": [
      {
        "input": "heights = [0,1,0,2,1,0,1,3,2,1,2,1]",
        "output": "6",
        "explanation": "Water can be trapped on top of the walls providing volumes of 1, 2, and 3."
      },
      {
        "input": "heights = [4,2,0,3,2,5]",
        "output": "9",
        "explanation": "Water can be trapped between heights 4 and 5, creating wells of height 2, 3, and 2."
      }
    ],
    "difficulty": "Hard",
    "hints": [
      "Consider how much water can be trapped at each position depending on the heights to the left and right.",
      "Use a two-pointer approach to efficiently calculate the trapped water."
    ],
    "company": "Credit Karma"
  },
  {
    "question_id": "",
    "title": "Monotone Increasing Digits",
    "description": "Given a non-negative integer N, find the largest integer X such that X is less than or equal to N, and X is a monotone increasing number. A number is monotone increasing if its digits are in non-decreasing order. For example, 123 and 135 are monotone increasing numbers, while 321 and 132 are not. Return the largest monotone increasing number less than or equal to N.",
    "topic": "Greedy",
    "subtopic": "Number Manipulation",
    "tags": [
      "Greedy",
      "Math",
      "String Manipulation"
    ],
    "input_format": "A single non-negative integer N.",
    "output_format": "A single integer representing the largest monotone increasing number less than or equal to N.",
    "constraints": [
      "0 <= N <= 10^9"
    ],
    "examples": [
      {
        "input": "N = 10",
        "output": "9",
        "explanation": "The largest monotone increasing number less than or equal to 10 is 9."
      },
      {
        "input": "N = 1234",
        "output": "1234",
        "explanation": "The number 1234 is already a monotone increasing number."
      },
      {
        "input": "N = 332",
        "output": "299",
        "explanation": "The largest monotone increasing number less than 332 is 299."
      }
    ],
    "difficulty": "Medium",
    "hints": [
      "Try to find the first decreasing digit from the left.",
      "After identifying the decreasing point, modify the digits accordingly."
    ],
    "company": "Credit Karma"
  },
  {
    "question_id": "",
    "title": "Basic Calculator II",
    "description": "Implement a basic calculator to evaluate a simple expression string containing non-negative integers, '+', '-', '*', and '/' operators. The integer division should truncate toward zero. Note that the input expression is guaranteed to be valid, and there are no parentheses.",
    "topic": "Math",
    "subtopic": "Expression Evaluation",
    "tags": [
      "Math",
      "Expression",
      "Calculator"
    ],
    "input_format": "A string s representing the expression to evaluate.",
    "output_format": "An integer representing the result of the evaluated expression.",
    "constraints": [
      "1 <= s.length <= 3 * 10^5",
      "s consists of integers and operators (+, -, *, /).",
      "There will not be any spaces in the expression."
    ],
    "examples": [
      {
        "input": "s = '3+2*2'",
        "output": "7",
        "explanation": "First we perform the multiplication: 2*2 = 4. Then we add: 3 + 4 = 7."
      },
      {
        "input": "s = ' 3/2 '",
        "output": "1",
        "explanation": "The result of 3 divided by 2 is 1 since we truncate toward zero."
      },
      {
        "input": "s = ' 3+5 / 2 '",
        "output": "5",
        "explanation": "First we perform the division: 5 / 2 = 2. Then we add: 3 + 2 = 5."
      }
    ],
    "difficulty": "Medium",
    "hints": [
      "Consider using a stack to handle the operations.",
      "Pay attention to the order of operations: multiplication and division before addition and subtraction."
    ],
    "company": "Credit Karma"
  }
]