[
  {
    "question_id": "",
    "title": "Spiral Matrix III",
    "description": "You are given two integers R and C representing the number of rows and columns of a matrix, and an integer K representing the starting position. Your task is to return the coordinates of the cells in the order they would be visited in a spiral order starting from (K, 0) and wrapping around the edges of the matrix. You should return exactly R * C coordinates, representing the traversal of the matrix in spiral order.",
    "topic": "Matrix",
    "subtopic": "Spiral Traversal",
    "tags": [
      "Matrix",
      "Spiral",
      "Traversal"
    ],
    "input_format": "Three integers R, C (the number of rows and columns) and K (the starting row position).",
    "output_format": "A list of coordinates representing the order of traversal.",
    "constraints": [
      "1 <= R, C <= 100",
      "0 <= K < R"
    ],
    "examples": [
      {
        "input": "R = 3, C = 3, K = 1",
        "output": "[[1, 0], [1, 1], [1, 2], [0, 2], [0, 1], [0, 0], [2, 0], [2, 1], [2, 2]]",
        "explanation": "Starting from (1, 0), we go right until we reach the end of the row, then we spiral back left and down."
      },
      {
        "input": "R = 4, C = 4, K = 0",
        "output": "[[0, 0], [0, 1], [0, 2], [0, 3], [1, 3], [2, 3], [3, 3], [3, 2], [3, 1], [3, 0], [2, 0], [1, 0], [1, 1], [1, 2], [2, 2], [2, 1]]",
        "explanation": "Starting from (0, 0), we traverse the matrix in spiral order."
      }
    ],
    "difficulty": "Medium",
    "hints": [
      "Think about the direction of movement: right, down, left, up.",
      "Use a loop to control the steps based on the matrix dimensions.",
      "Keep track of visited coordinates to avoid revisiting."
    ],
    "company": "Dataminr"
  },
  {
    "question_id": "",
    "title": "Maximum Building Height",
    "description": "You are given the positions and heights of buildings in a city as an array where each building is represented by an integer pair (position, height). Your task is to calculate the maximum height of buildings you can build, ensuring that no two buildings overlap and that every building must be at least the height of the starting or ending building in that interval. The positions are unique integers, and heights must be adjusted based on neighboring heights to avoid overlaps.",
    "topic": "Dynamic Programming",
    "subtopic": "Interval Scheduling",
    "tags": [
      "Dynamic Programming",
      "Greedy",
      "Interval"
    ],
    "input_format": "An array of tuples where each tuple contains two integers: the first integer is the position of the building and the second integer is its height.",
    "output_format": "An integer representing the maximum building height possible.",
    "constraints": [
      "1 <= buildings.length <= 10^5",
      "1 <= buildings[i][0] <= 10^9",
      "1 <= buildings[i][1] <= 10^6"
    ],
    "examples": [
      {
        "input": "buildings = [[2, 1], [3, 1], [5, 3], [6, 3]]",
        "output": "3",
        "explanation": "The maximum building height can be 3, built at position 5 or 6."
      },
      {
        "input": "buildings = [[1, 2], [3, 4], [5, 2]]",
        "output": "4",
        "explanation": "The maximum building height can be 4, built at position 3."
      }
    ],
    "difficulty": "Hard",
    "hints": [
      "Consider how building heights relate to their positions.",
      "Use sorting to handle building overlaps effectively."
    ],
    "company": "Dataminr"
  }
]