[
  {
    "question_id": "",
    "title": "Employee Bonus",
    "description": "You are given a list of integers representing the salaries of employees in a company. Your task is to determine the total bonus to be given out. The bonus is calculated as follows: employees with a salary greater than the average salary receive a bonus of 10% of their salary. If an employee's salary is less than or equal to the average, they receive no bonus. Return the total amount of bonuses to be distributed among all employees.",
    "topic": "Array",
    "subtopic": "Average Calculation",
    "tags": [
      "Array",
      "Average",
      "Bonus"
    ],
    "input_format": "An array of integers representing the salaries of employees.",
    "output_format": "An integer representing the total bonus to be distributed.",
    "constraints": [
      "1 <= salaries.length <= 10^4",
      "0 <= salaries[i] <= 10^6"
    ],
    "examples": [
      {
        "input": "salaries = [30000, 50000, 40000, 70000]",
        "output": "10000",
        "explanation": "Average salary is (30000 + 50000 + 40000 + 70000) / 4 = 47500. Employees with salaries 50000 and 70000 earn bonuses. 50000 gives 5000 bonus, 70000 gives 7000 bonus. Total = 5000 + 7000 = 12000."
      },
      {
        "input": "salaries = [10000, 20000, 30000]",
        "output": "0",
        "explanation": "The average salary is (10000 + 20000 + 30000) / 3 = 20000. All employees have salaries equal to or lower than the average, resulting in no bonuses."
      }
    ],
    "difficulty": "Easy",
    "hints": [
      "Calculate the average salary first.",
      "Iterate through the list to check which salaries exceed the average."
    ],
    "company": "Netsuite"
  },
  {
    "question_id": "",
    "title": "Average Salary Excluding the Minimum and Maximum Salary",
    "description": "You are given an array of unique integers representing the salaries of the employees. Write a function to calculate the average salary excluding the minimum and maximum salary. The average should be calculated as a floating point number, and the result should be rounded to two decimal places.",
    "topic": "Array",
    "subtopic": "Calculating Averages",
    "tags": [
      "Array",
      "Math",
      "Average"
    ],
    "input_format": "An array of integers salary where each integer is unique.",
    "output_format": "A floating point number representing the average salary excluding the minimum and maximum salary, rounded to two decimal places.",
    "constraints": [
      "3 <= salary.length <= 100",
      "1000 <= salary[i] <= 10^6"
    ],
    "examples": [
      {
        "input": "salary = [4000, 3000, 1000, 2000]",
        "output": "2500.00",
        "explanation": "The minimum salary is 1000, and the maximum salary is 4000. The average of the remaining salaries (3000 and 2000) is (3000 + 2000) / 2 = 2500."
      },
      {
        "input": "salary = [1000, 2000, 3000]",
        "output": "2000.00",
        "explanation": "The minimum salary is 1000, and the maximum salary is 3000. The average of the remaining salary (2000) is 2000."
      }
    ],
    "difficulty": "Easy",
    "hints": [
      "Consider using built-in methods to find the minimum and maximum values in the array."
    ],
    "company": "Netsuite"
  }
]