[
  {
    "question_id": "",
    "title": "Maximum Count of Positive Integer and Negative Integer",
    "description": "Given an integer array, calculate the maximum count of positive integers and negative integers. Return the counts in the form of a list where the first element is the count of positive integers and the second element is the count of negative integers.",
    "topic": "Array",
    "subtopic": "Counting Elements",
    "tags": [
      "Array",
      "Counting",
      "Positive",
      "Negative"
    ],
    "input_format": "An array of integers nums.",
    "output_format": "A list of two integers, [count of positive integers, count of negative integers].",
    "constraints": [
      "1 <= nums.length <= 10^4",
      "-10^5 <= nums[i] <= 10^5"
    ],
    "examples": [
      {
        "input": "nums = [1, -2, 3, 4, -5]",
        "output": "[3, 2]",
        "explanation": "There are three positive integers (1, 3, 4) and two negative integers (-2, -5)."
      },
      {
        "input": "nums = [0, 0, 0]",
        "output": "[0, 0]",
        "explanation": "There are no positive and no negative integers in the array."
      }
    ],
    "difficulty": "Easy",
    "hints": [
      "Iterate through the array and use counters for positives and negatives."
    ],
    "company": "ShareChat"
  },
  {
    "question_id": "",
    "title": "Amount of Time for Binary Tree to Be Infected",
    "description": "You are given a binary tree where each node is connected to its adjacent nodes. A virus is initially present at a specific node in the tree and spreads to all directly connected nodes in one unit of time. Your task is to calculate the amount of time it takes for the virus to infect all nodes in the binary tree. Return the time taken for the virus to spread throughout the entire tree.",
    "topic": "Tree",
    "subtopic": "Binary Tree",
    "tags": [
      "Tree",
      "DFS",
      "BFS",
      "Graph"
    ],
    "input_format": "The input consists of a binary tree represented as a root node and an integer representing the node where the virus starts.",
    "output_format": "An integer representing the time taken for the virus to infect all nodes in the binary tree.",
    "constraints": [
      "The binary tree will have at most 10^4 nodes.",
      "The value of each node is unique."
    ],
    "examples": [
      {
        "input": "root = [1,2,3,4,5,6,7], start = 3",
        "output": "4",
        "explanation": "Starting from node 3, the time taken for the virus to spread to all nodes is 4."
      },
      {
        "input": "root = [1,2,3,null,null,4,5], start = 5",
        "output": "3",
        "explanation": "Starting from node 5, the virus takes 3 units of time to infect all nodes in the tree."
      }
    ],
    "difficulty": "Medium",
    "hints": [
      "Consider using Depth-First Search or Breadth-First Search to traverse the tree.",
      "Track the nodes that are already infected to prevent re-infection.",
      "The time taken to reach each node depends on its distance from the starting node."
    ],
    "company": "ShareChat"
  }
]